In [15]:
import pandas as pd
df = pd.read_csv('cats.csv')
df.iloc[[98]]
df.loc[0]["Breed"]

'Egyptian Mau'

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   1000 non-null   int64
 1   Breed        1000 non-null   object
 2   Age (Years)  1000 non-null   int64
 3   Weight (kg)  1000 non-null   int64
 4   Color        1000 non-null   object
 5   Gender       1000 non-null   object
 6   ID           1000 non-null   int64
dtypes: int64(4), object(3)
memory usage: 54.8+ KB

In [13]:
df.columns

Index(['Unnamed: 0', 'Breed', 'Age (Years)', 'Weight (kg)', 'Color', 'Gender',
       'ID'],
      dtype='object')

In [25]:
df.loc[len(df)] = [0, 0, "Orange Tabby", 3, 5, "Orange", "Male", len(df)]
df.tail

<bound method NDFrame.tail of       Unnamed: 0          Breed   Age (Years)  Weight (kg)          Color  \
0              0   Egyptian Mau            12            7          White
1              1  Scottish Fold            17            8  Tortoiseshell
2              2         Sphynx             9            9         Orange
3              3       Oriental             6            7           Gray
4              4       Savannah            14            7  Tortoiseshell
...          ...            ...           ...          ...            ...
996          996        Burmese             4            5        Pointed
997          997        Persian            19            9          Cream
998          998        Persian            17            3        Bicolor
999          999           Manx            18            8          Black
1000           0              0  Orange Tabby            3              5

      Gender    ID  Weight (lbs)
0       Male   181        15.435
1       Male   907        17.640
2       Male   732        19.845
3     Female   464        15.435
4     Female   451        15.435
...      ...   ...           ...
996   Female   339        11.025
997     Male   659        19.845
998   Female   124         6.615
999     Male   226        17.640
1000  Orange  Male      1000.000

[1001 rows x 8 columns]>

In [20]:
df['Weight (lbs)'] = df['Weight (kg)'] * 2.205

In [26]:
df.head()

,Unnamed: 0,Breed,Age (Years),Weight (kg),Color,Gender,ID,Weight (lbs)
0,0,Egyptian Mau,12,7,White,Male,181,15.435
1,1,Scottish Fold,17,8,Tortoiseshell,Male,907,17.640
2,2,Sphynx,9,9,Orange,Male,732,19.845
3,3,Oriental,6,7,Gray,Female,464,15.435
4,4,Savannah,14,7,Tortoiseshell,Female,451,15.435

In [28]:
df.tail()

,Unnamed: 0,Breed,Age (Years),Weight (kg),Color,Gender,ID,Weight (lbs)
996,996,Burmese,4,5,Pointed,Female,339,11.025
997,997,Persian,19,9,Cream,Male,659,19.845
998,998,Persian,17,3,Bicolor,Female,124,6.615
999,999,Manx,18,8,Black,Male,226,17.640
1000,0,0,Orange Tabby,3,5,Orange,Male,1000.000